app/views/blogs/index.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."blog_id" = ?  [["blog_id", 1]]
---
		    <div class="comment-count">
		    	<span class="tag is-rounded"><%= blog.comments.count %> comments</span>