app/views/blogs/show.html.erb

	<div class="container">
		<h2 class="subtitle is-5"><strong><%= @blog.comments.count %></strong> Comments</h2>
---
SELECT "comments".* FROM "comments" WHERE "comments"."blog_id" = ?  [["blog_id", 6]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."blog_id" = ?  [["blog_id", 6]]