app/controllers/blogs_controller.rb

  def index
    @blogs = Blog.all.order("created_at DESC")
---
SELECT "blogs".* FROM "blogs" ORDER BY created_at DESC

  def create
    @blog = Blog.new(blog_params)

    if @blog.save
---
INSERT INTO "blogs" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "FIrst Blog"], ["content", "Blog content"], ["created_at", "2021-05-11 20:13:40.913620"], ["updated_at", "2021-05-11 20:13:40.913620"]]

  def update
    @blog = Blog.find(params[:id])
      if @blog.update(blog_params)
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "blogs" SET "content" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["content", "content for blog edited"], ["updated_at", "2021-05-12 06:45:32.307277"], ["id", 9]]

  def destroy
    @blog = Blog.find(params[:id])
    @blog.destroy
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
DELETE FROM "blogs" WHERE "blogs"."id" = ?  [["id", 10]]